export function TermsDocContent() {
  return (
    <div className="huma-legal-doc">
      <div>
        <h3>제 1장 총칙</h3>

        <div>
          <h4>제 1조 (목적)</h4>
          <p>
            본 약관은 테크앤조이(이하 &quot;회사&quot;)이 제공하는 컨텐츠 및 관련 제반 서비스를 포함한 유, 무료의
            모든 서비스(이하 &quot;서비스&quot;)의 이용조건 및 절차, 이용자와 회사의 권리, 의무, 책임사항과 기타
            필요한 사항을 규정함을 목적으로 합니다.
          </p>
        </div>

        <div>
          <h4>제 2조 (용어의 정의)</h4>
          <p>본 약관에서 사용하는 용어의 정의는 다음과 같습니다.</p>
          <ol>
            <li>이용자 : 회사가 제공하는 서비스에 접속하여 본 약관에 정해진 바에 따라 회사가 제공하는 서비스를 이용하는 회원을 의미</li>
            <li>회원 : 본 약관을 동의하고 회사의 서비스에 접속하여 약관에 따라 회사가 제공하는 서비스를 이용 하는 고객</li>
            <li>아이디(ID) : 회원식별과 회원의 서비스 이용을 위하여 회원이 신청하고 회사가 승인하는 문자 및 숫자의 조합</li>
            <li>비밀번호 : ID로 식별되는 회원의 본인여부를 확인하고, 회원 자신의 개인정보 등을 보호하기 위하여 당해 회원이 선정하여 회사에 등록한 문자와 숫자의 조합</li>
            <li>유료서비스 : 회사가 제공하는 서비스 가운데 회원이 대가를 지불하여야 이용할 수 있는 서비스, 디지털 컨텐츠, 스토리지 임대 서비스 및 기타 제반서비스.</li>
            <li>포인트 : 서비스의 효율적 이용을 위해 회사가 임의로 책정 또는 지급, 조정할 수 있는 재산적 가치가 없는 서비스상의 가상 데이터를 의미</li>
            <li>사이버 머니 : 회사가 별도로 명칭을 부여한 것으로서, 이용자가 신용카드 결제, 온라인 송금, 이동전화 결제, 증여를 받는 등의 방법으로 충전하여 서비스 내에서 현금처럼 사용하는 가상의 화폐</li>
            <li>게시물 : 서비스를 이용함에 있어 서비스상에 게시한 부호ㆍ문자ㆍ음성ㆍ음향ㆍ화상ㆍ동영상 등의 정보 형태의 글, 사진, 동영상 및 각종 파일과 링크 등을 의미</li>
            <li>탈퇴 : 회원이 이용계약을 종료하고, 회원자격을 포기하는 행위</li>
            <li>스팸 : 회원이 원하지 않는데도 불구하고 정보통신망을 통해 일방적으로 전송 또는 게시되는 영리목적의 광고성 정보</li>
            <li>불법스팸 : 정보통신망이용촉진및정보보호등에관한법률 등 관계법령을 위반하여 전송 또는 게시되는 영리목적의 광고성 정보</li>
          </ol>
          <p>
            본 약관에서 정의하지 않은 용어는 개별 서비스에 따른 별도 약관(이하 &quot;개별 약관&quot;) 및 이용규정이
            규정하는 바에 따르며 그 외에는 관계법령 및 일반관례에 따릅니다.
          </p>
        </div>

        <div>
          <h4>제 3조 (약관의 효력과 개정)</h4>
          <ol>
            <li>본 약관은 회원이 쉽게 알 수 있도록 초기화면에 게시하여 공시하며, 가입 시 회원의 동의와 회사의 승낙으로 효력이 발생합니다.</li>
            <li>회원은 본 약관에 동의함으로써 정기적으로 회사의 서비스를 방문하여 약관의 개정여부를 수시로 확인할 의무를 부담합니다. 약관의 개정에 대한 정보를 회사가 공시하였음에도 이를 확인하지 못해 발생한 회원의 피해는 회사가 책임지지 않습니다.</li>
            <li>회사는 합리적인 사유가 있는 경우 본 약관을 개정할 수 있으며, 회사가 본 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 서비스 초기화면에 그 적용일자로부터 소급하여 7일전부터 적용일자 전일까지 공지합니다. 단 약관의 개정이 회원에게 일방적으로 불리한 경우 회사는 최소 30일 이상의 유예기간을 두고 개정 전과 개정 후의 내용을 명확하게 비교하여 이를 회원에게 공지하여야 합니다.</li>
            <li>회원은 개정된 약관에 동의하지 아니할 경우 회사와의 이용계약을 해지하고 탈퇴할 수 있습니다.</li>
            <li>약관이 개정된 경우 개정약관은 그 적용일자 이후에 체결되는 이용계약에만 적용됩니다. 다만, 회사가 개정되는 약관의 내용을 공지하면서 별도로 &quot;회원이 개정약관의 효력발생일 이전에 개정약관에 대한 명시적인 적용거부의 의사를 표시하지 아니한 채로 서비스를 계속 이용하는 경우에는 개정약관의 적용에 동의한 것으로 간주합니다.&quot;는 공지를 하였음에도 기한 내 의사표시 없이 계속적으로 서비스를 이용하는 경우에는 개정 전에 체결된 이용계약에도 적용됩니다.</li>
          </ol>
        </div>

        <div>
          <h4>제 4조 (약관외 준칙)</h4>
          <ol>
            <li>회사는 필요에 따라 서비스 별로 개별 약관을 설치 운영할 수 있으며, 개별 약관은 본 약관과 함께 해당 서비스에 적용됩니다. 한편 개별 약관과 본 약관의 내용이 일치하지 아니하는 경우, 개별 약관이 우선하여 적용됩니다.</li>
            <li>본 약관에 명시되지 않은 사항이나 해석에 대해서는 &quot;유료서비스약관 등&quot; 및 관계법령 또는 상관례에 따릅니다.</li>
          </ol>
        </div>
      </div>

      <div>
        <h3>제 2장 이용계약의 체결</h3>

        <div>
          <h4>제 5조 (이용 계약의 성립)</h4>
          <ol>
            <li>이용계약은 신청자가 본 약관에 대한 동의의 의사표시와 함께 회사가 정한 소정의 양식에 따라 가입을 신청하고, 회사가 이를 승낙하는 것으로 성립됩니다.</li>
            <li>본 약관에 대한 동의는 회원가입 신청 시 이용약관 및 개인정보보호정책에 대한 &quot;동의함&quot; 버튼을 클릭함으로써 의사표시 한 것으로 간주합니다.</li>
            <li>신청자는 가입신청 시 반드시 본인의 진정한 정보를 제공하여야 하며, 타인의 개인정보를 이용하여 회사와 이용계약을 체결한 경우에는 어떠한 이유로도 보호 받지 못하며, 경우에 따라서는 관계법령에 의해 처벌 받을 수 있습니다. 또한 회사는 회원가입 시 신청자가 제공하는 정보에 대해 본인 여부를 확인할 수 있으며 신청자는 이에 협력하여야 합니다.</li>
            <li>
              회사는 다음 각 호에 해당하는 경우 대하여는 가입신청 승낙을 하지 않거나 사후에 이용계약을 해지할 수 있습니다.
              <ol>
                <li>신청자가 본 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우. 단, 자격이 상실된 때로부터 1년이 경과한 자.</li>
                <li>실명이 아니거나 제3자의 명의 또는 법인 명의를 사용하는 등 회원가입 시 필수정보를 허위로 제공하거나 고의로 누락, 오기하여 신청한 경우</li>
                <li>서비스 관련 제반 설비의 부족 혹은 기술상 장애 사유가 있어 이용계약을 체결하는 것이 현저히 곤란한 경우</li>
                <li>기타 이용계약의 체결이 관계법령이나 본 약관에 위배된다고 합리적으로 판단되는 경우</li>
              </ol>
            </li>
          </ol>
        </div>

        <div>
          <h4>제 6조 (개인정보보호)</h4>
          <p>
            회사는 관계법령이 정하는 바에 따라서 회원 등록정보를 포함한 회원의 개인정보를 보호하기 위하여 노력합니다.
            회원의 개인정보보호에 관해서는 관계법령 및 회사가 정하는 &quot;개인정보보호정책&quot;에 정한 바에 의합니다.
          </p>
        </div>
      </div>

      <div>
        <h3>제 3장 계약당사자의 의무</h3>

        <div>
          <h4>제 7조 (회사의 의무)</h4>
          <ol>
            <li>회사는 관계법령과 본 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 본 약관이 정하는 바에 따라 지속적이고, 안정적으로 서비스를 제공하기 위해 노력할 의무가 있습니다.</li>
            <li>회사는 특별한 사정이 없는 한 회원이 신청한 서비스 제공 개시일에 서비스를 이용할 수 있도록 합니다.</li>
            <li>회사는 회원이 안전하게 서비스를 이용할 수 있도록 회원의 개인정보 (신용정보 포함) 보호를 위한 보안시스템을 갖추어야 합니다.</li>
            <li>회사는 서비스 제공과 관련하여 수집한 회원의 개인정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않습니다. 다만, 법률의 규정에 따라 관계기관으로부터 적법한 절차에 의한 요청이 있을 경우에는 그러하지 않습니다.</li>
            <li>회사는 스팸수신 거부처리 등 스팸 관련 민원을 자체적으로 처리하기 위한 고충처리 창구를 운영합니다.</li>
            <li>회사는 회원이 불법스팸을 전송한 사실을 확인한 경우, 한국정보보호진흥원 불법스팸대응센터에 관련 자료를 첨부하여 신고할 수 있습니다.</li>
          </ol>
        </div>

        <div>
          <h4>제 8조 (회원의 ID 및 비밀번호 관리의무)</h4>
          <ol>
            <li>회원의 ID와 비밀번호, 개인정보에 관한 모든 관리의 책임은 회원 본인에게 있으며, 이로 인하여 발생한 책임은 관계법령, &quot;개인정보보호정책&quot;에 의해서 회사가 책임을 지는 경우를 제외하고, 회원이 부담합니다.</li>
            <li>회원은 자신의 ID와 비밀번호를 제3자에게 이용하게 해서는 안됩니다.</li>
            <li>회원은 자신의 ID와 비밀번호를 도난 당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 회사에 통보하고, 회사의 안내가 있는 경우에는 그에 따라야 합니다.</li>
          </ol>
        </div>

        <div>
          <h4>제 9조 (회원의 의무)</h4>
          <ol>
            <li>회원은 회원가입 시에 요구되는 정보를 정확하게 기입하여야 합니다. 또한 이미 제공된 회원에 대한 정보가 정확한 정보가 되도록 유지, 갱신하여야 합니다.</li>
            <li>회원은 회사의 사전 승낙 없이 서비스를 이용하여 어떠한 영리행위도 할 수 없습니다.</li>
            <li>회원은 서비스를 이용하여 얻은 정보를 회사의 사전승낙 없이 복사, 복제, 변경, 번역, 출판, 방송 기타의 방법으로 사용하거나 이를 타인에게 제공할 수 없습니다.</li>
            <li>
              회원은 서비스 이용과 관련하여 다음 각 호의 행위를 하여서는 안되며, 만약 각 호에 해당하는 경우 회사는 해당 회원에게 서비스 이용에 대한 제한 및 회원자격에 대한 제한 조치를 취할 수 있습니다.
              <ol>
                <li>회원가입 신청 또는 변경 시 허위내용을 등록하는 행위</li>
                <li>회사 기타 제3자의 명예를 훼손하거나 모욕하는 등 인격권을 침해하는 행위</li>
                <li>회사 기타 제3자의 지적재산권 등 권리를 침해하거나 업무를 방해하는 경우</li>
                <li>타인의 ID, 비밀번호 등을 도용하거나, 타인의 명의 및 신용정보를 도용하는 행위</li>
                <li>관계법령 또는 법률관계에 의하여 그 전송 또는 게시가 금지되는 정보의 전송 또는 게시행위</li>
                <li>서비스를 통하여 전송된 내용의 출처를 위장하는 행위</li>
                <li>정크메일, 스팸, 행운의 편지, 피라미드 조직에 가입할 것을 권유하는 메일, 외설 또는 폭력적인 메시지, 화상, 음성 등이 담긴 메일을 보내거나 기타 미풍양속에 반하는 정보를 공개 또는 게시하는 행위</li>
                <li>다른 사용자의 개인정보를 그의 동의 없이 수집 또는 저장하는 행위</li>
                <li>실질적으로 사용하지 아니하거나, 서비스의 목적 또는 내용과 부합하지 아니하는 목적으로 특정 domain 명칭 등을 선점하는 등의 행위</li>
                <li>해킹행위 또는 컴퓨터 바이러스 및 불법프로그램의 유포행위</li>
                <li>서비스의 안정적인 운영에 지장을 주거나 줄 우려가 있는 일체의 행위</li>
                <li>회사 사이트에 게시된 정보를 변경하거나 유료서비스 제도를 악용하는 행위</li>
                <li>전기통신사업법 제53조(불법통신의 금지 등)와 동법 시행령 제15조의2의 규정을 위반하거나 기타 법령, 선량한 풍속, 기타 사회질서에 반하는 불법한 행위</li>
              </ol>
            </li>
            <li>회원은 그 귀책사유로 인하여 회사나 제3자에게 손해가 발생한 경우, 이에 대한 손해를 배상할 책임이 있습니다.</li>
            <li>회원은 스팸 또는 불법스팸을 전송함으로써 발생하는 모든 민,형사상의 책임을 부담합니다.</li>
            <li>회원은 특정 결제수단에 한해 타인 명의로도 유료서비스의 결제가 가능하나, 타인의 동의 없이 해당 신용정보를 이용하여 유료서비스 결제를 행해서는 안됩니다.</li>
          </ol>
        </div>
      </div>

      <div>
        <h3>제 4장 서비스의 이용</h3>

        <div>
          <h4>제 10조 (서비스의 제공 및 변경)</h4>
          <ol>
            <li>
              회사가 제공하는 서비스는 아래와 같습니다.
              <ol>
                <li>컨텐츠 서비스(운세, 로또, 만화, 동영상 서비스 등)</li>
                <li>ARS서비스</li>
                <li>개방형 서비스(커뮤니티, 카페 등)</li>
                <li>기타 회사가 추가 개발하거나 다른 회사와의 협력계약 등을 통해 제공하는 일체의 서비스</li>
                <li>신점 상품 미판매</li>
              </ol>
            </li>
            <li>서비스는 연중무휴, 1일 24시간 제공함을 원칙으로 합니다.</li>
            <li>회사는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는 운영상 상당한 이유가 있는 경우 서비스의 제공을 일시적으로 중단할 수 있습니다. 이 경우 회사는 제19조에 정한 방법으로 회원에게 통지합니다. 다만, 회사가 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에 통지할 수 있습니다.</li>
            <li>회사는 상당한 이유가 있는 경우 변경될 서비스의 내용 및 제공일자를 회원에게 통지하고 서비스를 변경하여 제공할 수 있습니다.</li>
          </ol>
        </div>

        <div>
          <h4>제 11조 (서비스의 중지 및 정보의 저장과 사용)</h4>
          <ol>
            <li>회사는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 당해 서비스의 제공을 일시적으로 중지할 수 있으며, 회사가 새로운 서비스로의 교체, 기타 회사가 적절하다고 판단하는 사유가 발생한 경우에는 현재 제공되는 서비스를 완전히 중단할 수 있습니다.</li>
            <li>회사는 서비스의 일시 중지의 경우에는 서비스 중지 7일 전부터, 서비스의 완전중단의 경우에는 서비스 중단 30일 전부터 회원에게 중지 또는 중단 사실을 공지합니다. 회사는 회원이 이러한 공지 내용을 알지 못하여 입은 손해에 대해서 책임을 부담하지 아니합니다. 다만, 회사가 통제할 수 없는 사유로 인한 서비스의 중단(시스템 관리자의 고의, 과실이 없는 디스크 장애, 시스템 다운)등 부득이한 정황이 있는 경우 및 정기점검 등의 경우에는 사전 통지 기간은 감축되거나 생략될 수 있습니다.</li>
            <li>회사는 제1항 소정의 사유 또는 국가의 비상사태, 정전, 기타 회사가 통제할 수 없는 사유에 의하여 회원의 메시지, 기타 자료가 전송되지 못하였거나 보관되지 못한 경우 또는 회원의 자료가 삭제된 경우에 대한 책임을 부담하지 아니합니다. 다만, 회사의 유료 서비스상의 메시지 기타 자료가 회사의 고의 또는 중과실에 의하여 전송되지 못하였거나 보관되지 못한 경우 또는 당해 자료가 삭제된 경우에는 그러하지 아니합니다.</li>
          </ol>
        </div>

        <div>
          <h4>제 12조 (회원의 게시물 및 게시물의 저작권 등)</h4>
          <ol>
            <li>회원이 작성 또는 게시한 게시물 등 일체의 자료에 대한 권리와 책임은 회원에게 있습니다. 따라서 회원이 게시한 게시물로 인하여 발생하는 모든 민,형사상 책임은 회원 자신에게 있습니다. 단 회사가 작성한 게시물 또는 저작물에 대한 저작권 기타 지적재산권은 회사에 귀속됩니다.</li>
            <li>
              회원은 다음 각 호에 해당하는 게시물을 게시하거나 전송할 수 없으며, 회사는 서비스 내에 존재하는 게시물이 다음 각 호에 해당한다고 판단되는 경우 해당 게시물을 삭제, 임시조치, 이동 또는 등록거부 할 수 있습니다. 또한, 회사는 게시물에 관련된 세부 이용지침과 임시조치 등에 관한 구체적인 절차 등을 별도로 정하여 시행할 수 있으며, 회원은 회사가 정한 바에 따라 각종 게시물을 등록하거나 삭제하여야 합니다.
              <ol>
                <li>회사, 다른 회원 또는 제3자를 비방하거나 명예를 손상시키는 내용인 경우</li>
                <li>외설물, 음란물 등 공공질서 및 미풍양속에 위반되는 내용을 유포하는 경우</li>
                <li>범죄적 행위에 결부된다고 인정되는 내용인 경우</li>
                <li>회사 혹은 제3자의 저작권 등 기타 타인의 권리를 침해하는 내용인 경우</li>
                <li>법령을 위반하거나 타인의 권리를 침해할 목적으로 정치적, 종교적, 사회적 분쟁을 야기하는 경우</li>
                <li>영리 혹은 비영리를 목적으로 승인되지 않은 광고, 판촉물을 게재하는 경우</li>
                <li>타인의 개인정보를 도용하여 작성한 내용이거나, 타인이 입력한 정보를 무단으로 위변조한 내용인 경우</li>
                <li>탈퇴한 회원이 게시한 게시물인 경우</li>
                <li>동일한 내용을 중복, 반복하여 다수 게시하는 등 서비스의 목적에 어긋나는 경우</li>
                <li>기타 관계법령 및 약관 등에 위반되는 내용의 게시물인 경우</li>
              </ol>
            </li>
            <li>
              회원은 자신이 창작 또는 등록한 게시물에 대하여 회사가 허락한 제 3자가 서비스를 운영, 전시, 홍보 등을 목적으로 다음 각 호에 해당하는 행위를 할 수 있도록 사용료 없는 비독점적 사용권을 회사에게 부여합니다.
              <ol>
                <li>회사가 운영하는 관련 사이트의 서비스 내에서 상호 연동하기 위하여 회원 게시물을 복제, 전시, 배포 및 2차 저작물과 편집 저작물을 작성</li>
                <li>회사의 서비스를 확장, 홍보 등을 위한 목적으로 제휴 파트너에게 상업적 또는 비상업적으로 회원의 게시물을 제공하거나 사용하게 하는 것 (단, 이 경우 회사는 회원의 동의 없이 개인정보를 제공하지 않습니다.)</li>
              </ol>
            </li>
            <li>회사가 회원의 게시물을 전항 각 호에 기재된 목적 이외에 상업적 목적으로 사용할 경우에는 사전에 해당 회원으로부터 동의를 얻어야 합니다. 게시물에 대한 회사의 사용 요청, 회원의 동의 및 동의철회는 전화, 전자우편, 팩스 등 회사가 요청하는 방식에 따릅니다. 이 경우 회사는 게시물의 출처를 표시하며 게시물의 사용에 동의한 해당 회원에게 별도의 보상을 제공합니다.</li>
            <li>회원이 이용계약을 해지한 경우 해당 ID 및 계정에 기록된 게시물 일체는 삭제됩니다. 단, 타인에 의해 보관, 담기 등으로 재게시 되거나 복제된 게시물과 타인의 게시물과 결합되어 제공되는 게시물, 공용 게시판에 등록된 게시물 등은 그러하지 않습니다.</li>
          </ol>
        </div>

        <div>
          <h4>제 13조 (정보 제공 및 광고의 게재)</h4>
          <ol>
            <li>회사는 서비스의 운영 및 정보제공과 관련하여 서비스 화면, 홈페이지, 커뮤니티, 이메일 등에 광고 등을 게재할 수 있습니다.</li>
            <li>회사가 서비스상에 게재하는 광고에 대한 가치판단은 회원이 하여야 하며 그러한 광고주의 판촉활동에 회원이 참여하여 발생하는 결과에 대해서는 회사가 책임을 지지 않습니다.</li>
            <li>회사는 회원에게 서비스 이용에 필요가 있다고 인정되는 각종 정보를 전자우편이나 서신, 전화 등의 방법으로 회원에게 제공할 수 있습니다.</li>
            <li>회사는 서비스 개선 및 소개 등의 목적으로 회원의 동의 하에 추가적인 개인 정보를 수집할 수 있습니다.</li>
          </ol>
        </div>

        <div>
          <h4>제 14조 (회사의 책임제한)</h4>
          <ol>
            <li>회사는 회사가 제공한 서비스가 아닌 회원 또는 기타 제휴사가 제공하는 정보 또는 서비스의 내용에 대해 정확성, 완전성 및 품질에 대하여 보장하지 않습니다. 따라서 회사는 회원이 이러한 정보 또는 서비스의 이용으로 인한 결과에 대하여 책임을 부담하지 아니합니다.</li>
            <li>회사가 제공하는 서비스를 이용하여 타인에게 피해를 주거나 미풍양속을 해치는 등 본 약관과 관계법령을 위반한 이용자는 보호 받을 수 없으며, 관련 정보 또한 보호 받을 수 없습니다.</li>
          </ol>
        </div>

        <div>
          <h4>제 15조 (유료서비스)</h4>
          <ol>
            <li>
              유료서비스 이용
              <ol>
                <li>회사가 제공하는 서비스 및 컨텐츠에 대한 지적재산권 등의 권리는 회사에 귀속되며, 회사가 유료로 제공하는 서비스 및 컨텐츠에 대한 사용권은 해당 서비스 및 컨텐츠를 구매한 회원에게 있습니다. 따라서 회원은 회사가 제공하는 서비스 및 컨텐츠를 미리 정해진 기간 동안 회사의 사이트 내에서 사용할 권한을 갖게 되며, 이를 회사가 정한 방법 이외의 방법으로 양도, 판매 할 수 없습니다.</li>
                <li>유료서비스 및 컨텐츠의 이용요금은 각 서비스 별로 홈페이지 등에 명시된 가격을 따르며, 회원은 회사에서 제시한 개별 약관에 동의하고 결제수단 별로 정해진 결제절차에 따라 충전한 사이버 머니 또는 포인트 혹은 개별 이용요금을 지불한 후 해당 서비스 및 컨텐츠를 사용할 수 있습니다.</li>
                <li>회사가 제공하는 유료서비스 및 컨텐츠의 유효기간은 1년이며, 개별적으로 유효기간을 달리 명시한 경우에는 해당 기간이 우선합니다.</li>
                <li>회사는 제휴계약의 종료, 권리자와의 이용계약의 변경, 기타 합리적인 사유가 발생할 경우 해당 유료서비스 및 컨텐츠의 제공을 중단할 수 있으며, 이 때 유효기간이 만료되지 않은 서비스 또는 컨텐츠에 대해서는 잔여 기간에 상응하는 수준의 컨텐츠 또는 사이버 머니 또는 포인트 재충전의 형태로 회원에게 보상합니다. 단 회사가 보상하는 유료서비스 또는 컨텐츠는 최초 구입일로부터 365일이 경과하지 않은 경우에 한 합니다.</li>
                <li>유료서비스 및 컨텐츠의 결제, 환불 및 기타 세부적인 사항은 별도로 공지하는 사이버 머니 또는 포인트 이용약관에 따릅니다.</li>
                <li>회사는 별도로 정한 바에 따라 회원에게 이용요금을 감면할 수 있고, 기타 혜택을 부여할 수 있습니다.</li>
                <li>전 항의 규정에 따라 이용요금의 감면, 면제 및 할인 적용을 받는 대상자는 자신의 자격이 변동된 경우에 즉시 이를 회사에 알려야 합니다.</li>
              </ol>
            </li>
            <li>
              유료서비스의 이용제한
              <ol>
                <li>회사는 회원이 음란, 불온, 불법적 목적이나 기타 관계법령, 공공질서, 미풍 양속 등에 반하는 목적으로 서비스를 이용할 경우 그러한 회원에 대한 유료서비스 이용을 취소, 제한할 수 있으며, 해당 회원에 대해 회원자격을 박탈할 수 있습니다.</li>
                <li>기타 유료서비스의 이용중지 및 회원의 자격박탈, 제한 등에 관한 사항은 본 약관 제18조의 규정에 따릅니다.</li>
              </ol>
            </li>
          </ol>
        </div>
      </div>

      <div>
        <h3>제 5장 계약 해지 및 이용 제한</h3>

        <div>
          <h4>제 16조 (계약의 해지)</h4>
          <ol>
            <li>회원이 이용계약을 해지하고자 하는 경우에는 회원 본인이 해지신청을 하여야 합니다. 해지신청은 홈페이지 내 고객센터 또는 내 정보 관리 메뉴 등을 통하여 언제든지 신청 할 수 있으며 회사는 회원의 해지신청을 접수할 경우, 상당한 이유가 없는 한 즉시 이를 수락하고 회원의 개인정보 및 서비스 관련 정보(게시물, 이용정보 등)를 삭제합니다.</li>
            <li>회사는 타인의 ID 도용 등으로 인한 회원탈퇴 등을 방지할 목적으로 &quot;개인정보보호정책&quot;이 규정하는 바에 의해 탈퇴 회원의 정보삭제를 일정 기간 유예할 수 있습니다.</li>
          </ol>
        </div>

        <div>
          <h4>제 17조 (서비스의 이용제한 등)</h4>
          <ol>
            <li>
              회원이 다음 각 호의 사유에 해당하거나, 해당한다고 합리적으로 판단되는 명백한 정황이 발견된 경우, 회사는 회원의 회원자격을 제한, 박탈하거나 당해 서비스의 이용을 제한, 중지할 수 있습니다.
              <ol>
                <li>회사에 제공한 회원의 정보가 진실하지 않은 경우(타인의 개인정보, 신용정보를 도용하거나 허위의 개인정보를 제공한 경우 등)</li>
                <li>서비스 이용 시 게시물 등을 통하여 제3자를 비방하거나 타인의 프라이버시를 침해하거나 또는 음란, 저속한 행위를 한 경우</li>
                <li>서비스 이용 시 게시물 등을 통하여 인격권, 지적재산권 등 제3자의 권리를 침해하는 경우(타인의 ID, 비밀번호를 도용한 경우 등)</li>
                <li>스팸 등의 전송으로 인해 시스템 장애를 야기했을 경우</li>
                <li>메일 등을 통해 해당 광고를 수신한 회원이 수신거부를 요청하였음에도 불구하고 지속적으로 재전송한 경우</li>
                <li>당해 연도에 2회 이상 이용정지를 당한 경우</li>
                <li>기타 관계법령 또는 본 약관이 금지하거나 미풍양속에 반하는 행위를 한 경우</li>
                <li>정보통신윤리위원회 등 관련 기관으로부터 시정요구를 받아 이에 근거하여 회사가 조치할 의무가 있는 경우</li>
                <li>불법 컨텐츠 및 타인의 저작물을 무단으로 복제하여, 전송, 배포, 전시, 게재한 경우</li>
                <li>기타 안정적인 서비스 운영을 방해하거나 회사 및 다른 회원에게 피해를 줄 목적으로 비정상적인 수단을 사용하여 서비스를 이용하거나 그러한 시도를 한 경우</li>
              </ol>
            </li>
            <li>회사는 회원이 휴면회원으로 분류된 후 연속하여 10개월 동안 로그인 기록이 없는 경우 이용계약을 해지할 수 있으며, 이용계약이 해지된 회원의 계정별 서비스(메일, 동영상홈피, 커뮤니티, 섬 등)에 저장된 문서,파일 등의 자료를 임의로 삭제할 수 있습니다. 단, 부재중 기간을 설정한 회원은 부재중 기간이 끝나는 시점을 마지막 로그인 시점으로 봅니다.</li>
            <li>회사는 메일휴면회원에 대하여 메일을 수령할 수 없도록 제한을 가할 수 있고, 메일휴면회원으로 분류된 후 1개월 동안 메일페이지 로그인 기록이 없는 경우, 회원의 메일함을 임의로 변경 또는 삭제할 수 있습니다. 단, 부재중 기간을 설정한 회원은 부재중 기간이 끝나는 시점을 마지막 로그인 시점으로 봅니다.</li>
            <li>회사는 서비스의 원활한 수행을 저해하는 제3자와 회원간의 혹은 회원 상호간의 스팸메일, 대량메일 등의 전송행위를 방지하기 위하여 여러 가지 기술적, 제도적 정책을 시행할 수 있으며, 이로 인하여 회원은 회사가 제공하는 서비스의 이용에 제한을 받을 수 있습니다.</li>
            <li>회사가 회원의 자격을 박탈하는 경우에는 당해 회원에게 사전 혹은 사후 통지하고, 해당 사안에 대한 재심을 통해 소명할 기회를 부여합니다. 단 동일한 사안에 대한 재심은 1회로 제한합니다.</li>
          </ol>
        </div>
      </div>

      <div>
        <h3>제 6 장 기 타</h3>

        <div>
          <h4>제 18조 (지적재산권 및 양도금지)</h4>
          <ol>
            <li>회사가 제공하는 서비스, 그에 필요한 소프트웨어, 이미지, 마크, 로고, 디자인, 서비스명칭, 정보 및 상표 등과 관련된 지적재산권 및 기타 권리는 회사에게 있습니다.</li>
            <li>이용자는 회사가 명시적으로 승인한 경우를 제외하고는 전 항에 규정된 권리의 전부 또는 일부를 수정, 대여, 대출, 판매, 배포, 제작, 양도, 재라이센스, 담보권 설정 행위, 상업적 이용 행위를 할 수 없으며, 제3자로 하여금 이와 같은 행위를 하도록 허락할 수 없습니다.</li>
            <li>이용자가 제2항을 위반해 타인의 권리를 침해하는 경우 이에 대한 책임은 이용자가 부담하며, 회사는 이에 대해 책임을 부담하지 않습니다.</li>
            <li>이용자는 서비스의 이용권한, 기타 이용계약상 지위를 타인에게 양도, 증여할 수 없으며, 이를 담보로 제공할 수 없습니다.</li>
          </ol>
        </div>

        <div>
          <h4>제 19조 (손해배상 및 회원에 대한 통지)</h4>
          <ol>
            <li>회사는 서비스와 관련하여 회사의 고의 또는 중과실로 회원에게 손해가 발생한 경우 이를 배상할 책임을 부담합니다.</li>
            <li>
              다음과 같은 경우에는 회사는 손해배상책임의 책임을 부담하지 않습니다.
              <ol>
                <li>서비스 향상 등을 위해 사전에 공지하거나 정기적으로 실시하는 정기점검으로 인한 서비스 불안정 및 서비스 중지로 인한 경우</li>
                <li>발생한 손해가 이용자의 귀책사유로 인한 것일 경우</li>
                <li>화재, 홍수 등의 천재지변 또는 파업, 전력수급의 차질 등 회사의 통제범위를 벗어난 사유로 인한 손해나 서비스 지연</li>
              </ol>
            </li>
            <li>제1항의 손해배상의 청구는 청구사유, 청구금액 및 산출근거를 기재하여 서면으로 하여야 합니다.</li>
            <li>회사는 이용자의 고의 또는 과실로 인한 서비스 이용장애 및 이용제한에 대해서는 배상할 책임이 없습니다.</li>
            <li>회사가 특정 회원에 대한 통지를 하는 경우, 회사가 부여한 메일주소 기타 회원의 메일주소로 할 수 있습니다.</li>
            <li>회사가 불특정 다수의 이용자에 대한 통지를 하는 경우, 7일 이상의 기한 동안 서비스 초기화면 또는 공지사항 게시판에 게시함으로써 개별 통지에 갈음할 수 있습니다.</li>
          </ol>
        </div>

        <div>
          <h4>제 20조 (준거법 및 관할법원)</h4>
          <ol>
            <li>회사와 회원 간 제기된 소송은 대한민국법을 준거법으로 합니다.</li>
            <li>회사와 회원간 발생한 분쟁에 관한 소송은 민사소송법 상의 관할법원에 제소합니다.</li>
          </ol>
        </div>
      </div>

      <div className="huma-legal-doc-footnote">
        <p>본 약관은 2011년 12월 1일부터 적용됩니다.</p>
      </div>
    </div>
  );
}

export function PrivacyDocContent() {
  return (
    <div className="huma-legal-doc">
      <div>
        <p>
          테크앤조이(이하 &quot;회사&quot;)는 통신비밀보호법, 전기통신사업법, 정보통신망 이용촉진 및 정보보호 등에 관한
          법률 등 정보통신서비스제공자가 준수하여야 할 관련 법령상의 개인정보보호 규정을 준수하며, 관련 법령에
          의거한 개인정보취급방침을 정하여 이용자 권익 보호에 최선을 다하고 있습니다.
        </p>
        <p>본 개인정보취급방침은 다음과 같은 내용을 담고 있습니다.</p>
        <ol>
          <li>수집하는 개인정보의 항목 및 수집방법</li>
          <li>개인정보의 수집 및 이용목적</li>
          <li>개인정보 공유 및 제공</li>
          <li>개인정보의 보유 및 이용기간</li>
          <li>개인정보 파기절차 및 방법</li>
          <li>이용자 및 법정대리인의 권리와 그 행사방법</li>
          <li>개인정보 자동 수집 장치의 설치/운영 및 거부에 관한 사항</li>
          <li>개인정보의 기술적/관리적 보호 대책</li>
          <li>개인정보관리책임자 및 담당자의 연락처</li>
          <li>기타</li>
          <li>고지의 의무</li>
        </ol>
      </div>

      <div>
        <h3>1. 수집하는 개인정보의 항목 및 수집방법</h3>

        <div>
          <h4>가. 수집하는 개인정보의 항목</h4>
          <p>첫째, 회사는 회원가입, 원활한 고객상담, 각종 서비스의 제공을 위해 최초 회원가입 당시 아래와 같은 개인정보를 수집하고 있습니다.</p>
          <p>수집항목 : 이름, 생년월일, 양/음력, 태어난 시/분, 성별, 아이디, 결제기록, 휴대전화번호, 통신사 정보</p>
          <p>둘째, 서비스 이용과정이나 사업처리 과정에서 아래와 같은 정보들이 자동으로 생성되어 수집될 수 있습니다.</p>
          <p>IP Address, 쿠키, 방문 일시, 서비스 이용 기록, 불량 이용 기록</p>
          <p>셋째, 유료 서비스 이용 과정에서 아래와 같은 결제 정보들이 수집될 수 있습니다.</p>
          <p>휴대전화 결제시 : 이동전화번호, 통신사, 결제승인번호 등</p>
          <p>상품권 이용시 : 상품권 번호</p>
        </div>

        <div>
          <h4>나. 개인정보 수집방법</h4>
          <p>회사는 다음과 같은 방법으로 개인정보를 수집합니다.</p>
          <p>홈페이지, 서면양식, 팩스, 전화, 상담 게시판, 이메일, 이벤트 응모, 배송요청협력회사로부터의 제공생성정보 수집 툴을 통한 수집</p>
        </div>
      </div>

      <div>
        <h3>2. 개인정보의 수집 및 이용목적</h3>
        <p>
          회사는 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는
          이용되지 않으며, 이용 목적이 변경되는 경우에는 법률에 따라 별도의 동의를 받는등 필요한 조치를 이행할
          예정입니다.
        </p>

        <table>
          <thead>
            <tr>
              <th>수집 목적</th>
              <th>구분</th>
              <th>수집 항목</th>
              <th>수집 방법</th>
              <th>보유 기간</th>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td rowSpan={2}>회원 가입</td>
              <td>네이버 간편가입</td>
              <td>네이버 계정(이메일, 식별번호)</td>
              <td>홈페이지, 모바일앱</td>
              <td rowSpan={2}>
                회원 탈퇴 즉시 파기
                <br />
                부정이용 방지를 위하여 30일 동안 보관(아이디, 휴대폰 번호) 후 파기
              </td>
            </tr>
            <tr>
              <td>카카오 간편가입</td>
              <td>카카오 계정(이메일, 식별번호)</td>
              <td>홈페이지, 모바일앱</td>
            </tr>
            <tr>
              <td>운세 콘텐츠 제공, 효율적인 고객 지원 및 운영</td>
              <td></td>
              <td>이름, 성별, 생년월일시, 양/음력</td>
              <td>홈페이지, 모바일앱</td>
              <td>컨텐츠 제공 완료 (다시보기 7일 만료) 후 개인정보 자동 파기</td>
            </tr>
            <tr>
              <td>서비스방문 및이용기록 분석, 부정이용 방지 등을 위한 기록 관리</td>
              <td></td>
              <td>서비스 이용기록, 모바일기기정보(광고식별자, OS/앱 버번)</td>
              <td>홈페이지, 모바일앱</td>
              <td>회원 탈퇴 즉시 또는 이용 목적 달성 즉시 파기</td>
            </tr>
          </tbody>
        </table>

        <div>
          <p>가. 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금정산</p>
          <p>컨텐츠 제공, 특정 맞춤 서비스 제공, 물품배송 또는 청구서 등 발송, 본인인증, 구매 및 요금 결제, 요금추심</p>
          <p>나. 회원관리</p>
          <p>회원제 서비스 이용 및 제한적 본인 확인제에 따른 본인확인, 개인식별, 불량회원의 부정 이용방지와 비인가 사용방지, 가입의사 확인, 가입 및 가입횟수 제한, 만14세 미만 아동 개인정보 수집 시 법정 대리인 동의여부 확인, 추후 법정 대리인 본인확인, 분쟁 조정을 위한 기록보존, 불만처리 등 민원처리, 고지사항 전달</p>
          <p>다. 신규 서비스 개발 및 마케팅</p>
          <p>신규 서비스 개발 및 맞춤 서비스 제공, 통계학적 특성에 따른 서비스 제공 및 광고 게재, 서비스의 유효성 확인, 이벤트 및 광고성 정보 제공 및 참여기회 제공, 접속빈도 파악, 회원의 서비스이용에 대한 통계</p>
        </div>

        <div className="huma-legal-doc-note">
          <p>
            <strong>*</strong> 개인정보 수집 및 이용에 대해서는 거부 할 수 있으며, 거부 시에는 서비스 이용이
            불가합니다.
          </p>
        </div>
      </div>

      <div>
        <h3>3. 개인정보의 공유 및 제공</h3>
        <p>
          회사는 이용자들의 개인정보를 &quot;2. 개인정보의 수집목적 및 이용목적&quot;에서 고지한 범위내에서 사용하며,
          이용자의 사전 동의 없이는 동 범위를 초과하여 이용하거나 원칙적으로 이용자의 개인정보를 외부에 공개하지
          않습니다. 다만, 아래의 경우에는 예외로 합니다.
        </p>
        <ul>
          <li>이용자들이 사전에 공개에 동의한 경우</li>
          <li>법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우</li>
        </ul>
      </div>

      <div>
        <h3>4. 개인정보의 보유 및 이용기간</h3>
        <p>
          이용자의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체 없이 파기합니다. 단, 다음의
          정보에 대해서는 아래의 이유로 명시한 기간 동안 보존합니다.
        </p>
        <div>
          <h4>가. 회사 내부 방침에 의한 정보보유 사유</h4>
          <div>
            <p>
              <strong>&lt; 부정이용기록 &gt;</strong>
            </p>
            <p>보존 이유 : 부정 이용 방지</p>
            <p>보존 기간 : 1년</p>
          </div>
        </div>
        <div>
          <h4>나. 관련법령에 의한 정보보유 사유</h4>
          <p>
            상법, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계법령의 규정에 의하여 보존할 필요가 있는 경우
            회사는 관계법령에서 정한 일정한 기간 동안 회원정보를 보관합니다. 이 경우 회사는 보관하는 정보를 그
            보관의 목적으로만 이용하며 보존기간은 아래와 같습니다.
          </p>
          <div>
            <div>
              <p>
                <strong>&lt; 계약 또는 청약철회 등에 관한 기록 &gt;</strong>
              </p>
              <p>보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률</p>
              <p>보존 기간 : 5년</p>
            </div>
            <div>
              <p>
                <strong>&lt; 대금결제 및 재화 등의 공급에 관한 기록 &gt;</strong>
              </p>
              <p>보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률</p>
              <p>보존 기간 : 5년</p>
            </div>
            <div>
              <p>
                <strong>&lt; 소비자의 불만 또는 분쟁처리에 관한 기록 &gt;</strong>
              </p>
              <p>보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률</p>
              <p>보존 기간 : 3년</p>
            </div>
            <div>
              <p>
                <strong>&lt; 본인확인에 관한 기록 &gt;</strong>
              </p>
              <p>보존 이유 : 정보통신 이용촉진 및 정보보호 등에 관한 법률</p>
              <p>보존 기간 : 6개월</p>
            </div>
            <div>
              <p>
                <strong>&lt; 방문에 관한 기록 &gt;</strong>
              </p>
              <p>보존 이유 : 통신비밀보호법</p>
              <p>보존 기간 : 3개월</p>
            </div>
          </div>
        </div>
      </div>

      <div>
        <h3>5. 개인정보 파기절차 및 방법</h3>
        <p>이용자의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체 없이 파기합니다.회사의 개인정보 파기절차 및 방법은 다음과 같습니다.</p>
        <div>
          <h4>가. 파기절차</h4>
          <ul>
            <li>이용자가 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 별도의 DB로 옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(보유 및 이용기간 참조)일정 기간 저장된 후 파기됩니다.</li>
            <li>동 개인정보는 법률에 의한 경우가 아니고서는 보유되는 이외의 다른 목적으로 이용되지 않습니다.</li>
          </ul>
        </div>
        <div>
          <h4>나. 파기방법</h4>
          <ul>
            <li>종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다</li>
            <li>전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.</li>
          </ul>
        </div>
      </div>

      <div>
        <h3>6. 이용자 및 법정대리인의 권리와 그 행사방법</h3>
        <ul>
          <li>이용자 및 법정 대리인은 언제든지 등록되어 있는 자신 혹은 당해 만 14세 미만 아동의 개인정보를 조회하거나 수정할 수 있으며 가입해지를 요청할 수도 있습니다.</li>
          <li>이용자 혹은 만 14세 미만 아동의 개인정보 조회, 수정을 위해서는 &apos;개인정보변경&apos;(또는 &apos;회원정보수정&apos; 등)을, 가입해지(동의철회)를 위해서는 &quot;회원탈퇴&quot;를 클릭하여 본인 확인 절차를 거치신 후 직접 열람, 정정 또는 탈퇴가 가능합니다.</li>
          <li>혹은 개인정보관리책임자에게 서면, 전화 또는 이메일로 연락하시면 지체 없이 조치하겠습니다.</li>
          <li>이용자가 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를 제3 자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체 없이 통지하여 정정이 이루어지도록 하겠습니다.</li>
          <li>회사는 이용자 혹은 법정 대리인의 요청에 의해 해지 또는 삭제된 개인정보는 &quot;5. 개인정보의 보유 및 이용기간&quot;에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.</li>
        </ul>
      </div>

      <div>
        <h3>7. 개인정보 자동 수집 장치의 설치/운영 및 거부에 관한 사항</h3>
        <p>
          회사는 이용자들에게 특화된 맞춤서비스를 제공하기 위해서 이용자들의 정보를 저장하고 수시로 불러오는
          &apos;쿠키(cookie)&apos;를 사용합니다. 쿠키는 웹사이트를 운영하는데 이용되는 서버(HTTP)가 이용자의 컴퓨터
          브라우저에게 보내는 소량의 정보이며 이용자들의 PC 컴퓨터내의 하드디스크에 저장되기도 합니다.
        </p>
        <div>
          <h4>가. 쿠키의 사용 목적</h4>
          <p>이용자들이 방문한 회사의 각 서비스와 웹 사이트들에 대한 방문 및 이용형태, 인기 검색어, 보안접속 여부, 뉴스편집, 이용자 규모 등을 파악하여 이용자에게 최적화된 정보 제공을 위하여 사용합니다.</p>
        </div>
        <div>
          <h4>나. 쿠키의 사용 목적</h4>
          <ul>
            <li>이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서, 이용자는 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도 있습니다.</li>
            <li>쿠키 설정을 거부하는 방법으로는 이용자가 사용하는 웹 브라우저의 옵션을 선택함으로써 모든 쿠키를 허용하거나 쿠키를 저장할 때마다 확인을 거치거나, 모든 쿠키의 저장을 거부할 수 있습니다.</li>
            <li>설정방법 예(인터넷 익스플로어의 경우) : 웹 브라우저 상단의 도구 &gt; 인터넷 옵션 &gt; 개인정보</li>
            <li>다만, 쿠키의 저장을 거부할 경우에는 로그인이 필요한 일부 서비스는 이용에 어려움이 있을 수 있습니다.</li>
          </ul>
        </div>
      </div>

      <div>
        <h3>8. 개인정보의 기술적/관리적 보호 대책</h3>
        <p>
          회사는 이용자들의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록
          안전성 확보를 위하여 다음과 같은 기술적/관리적 대책을 강구하고 있습니다.
        </p>
        <div>
          <h4>가. 비밀번호 암호화</h4>
          <p>회원 아이디(ID)의 비밀번호는 암호화되어 저장 및 관리되고 있어 본인만이 알고 있으며, 개인정보의 확인 및 변경도 비밀번호를 알고 있는 본인에 의해서만 가능합니다.</p>
        </div>
        <div>
          <h4>나. 해킹 등에 대비한 대책</h4>
          <p>
            회사는 해킹이나 컴퓨터 바이러스 등에 의해 회원의 개인정보가 유출되거나 훼손되는 것을 막기 위해 최선을
            다하고 있습니다. 개인정보의 훼손에 대비해서 자료를 수시로 백업하고 있고, 최신 백신프로그램을 이용하여
            이용자들의 개인정보나 자료가 누출되거나 손상되지 않도록 방지하고 있으며, 암호화통신 등을 통하여
            네트워크상에서 개인정보를 안전하게 전송할 수 있도록 하고 있습니다. 그리고 침입차단시스템을 이용하여
            외부로부터의 무단 접근을 통제하고 있으며, 기타 시스템적으로 보안성을 확보하기 위한 가능한 모든 기술적
            장치를 갖추려 노력하고 있습니다.
          </p>
        </div>
        <div>
          <h4>다. 취급 직원의 최소화 및 교육</h4>
          <p>회사의 개인정보관련 취급 직원은 담당자에 한정시키고 있고 이를 위한 별도의 비밀번호를 부여하여 정기적으로 갱신하고 있으며, 담당자에 대한 수시 교육을 통하여 개인정보취급방침의 준수를 항상 강조하고 있습니다.</p>
        </div>
        <div>
          <h4>라. 개인정보보호전담기구의 운영</h4>
          <p>그리고 사내 개인정보보호전담기구 등을 통하여 개인정보취급방침의 이행사항 및 담당자의 준수여부를 확인하여 문제가 발견될 경우 즉시 수정하고 바로 잡을 수 있도록 노력하고 있습니다.</p>
          <p>단, 이용자 본인의 부주의나 인터넷상의 문제로 ID, 비밀번호, 주민등록번호 등 개인정보가 유출되어 발생한 문제에 대해 회사는 일체의 책임을 지지 않습니다.</p>
        </div>
      </div>

      <div>
        <h3>9. 개인정보관리책임자 및 담당자의 연락처</h3>
        <p>
          귀하께서는 회사의 서비스를 이용하시며 발생하는 모든 개인정보보호 관련 민원을 개인정보관리책임자 혹은
          담당부서로 신고하실 수 있습니다. 회사는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.
        </p>
        <div>
          <h4>개인정보 관리책임자</h4>
          <table>
            <thead>
              <tr>
                <th>구분</th>
                <th>이름</th>
                <th>소속</th>
                <th>전화</th>
                <th>직위</th>
                <th>메일</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td>개인정보 관리 책임자/담당자</td>
                <td>정홍규</td>
                <td>개발팀</td>
                <td>070-4323-7009</td>
                <td>팀장</td>
                <td>vcpro@techenjoy.co.kr</td>
              </tr>
            </tbody>
          </table>
          <p>기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다</p>
          <ul>
            <li>개인분쟁조정위원회 (www.1336.or.kr / 1336)</li>
            <li>정보보호마크인증위원회 (www.eprivacy.or.kr / 02-580-0533~4)</li>
            <li>대검찰청 인터넷범죄수사센터 (http://icic.sppo.go.kr / 02-3480-3600)</li>
            <li>경찰청 사이버테러대응센터 (www.ctrc.go.kr / 02-392-0330)</li>
          </ul>
        </div>
      </div>

      <div>
        <h3>10. 기타</h3>
        <p>서비스에 링크되어 있는 웹사이트들이 개인정보를 수집하는 행위에 대해서는 본 &quot;개인정보취급방침&quot;이 적용되지 않음을 알려 드립니다.</p>
      </div>

      <div>
        <h3>11. 고지의 의무</h3>
        <p>현 개인정보취급방침 내용 추가, 삭제 및 수정이 있을 시에는 개정 최소 7일전부터 홈페이지의 &apos;공지사항&apos;을 통해 고지할 것입니다.</p>
      </div>

      <div className="huma-legal-doc-footnote">
        <p>시행일자 : 2011년 12월 1일</p>
      </div>
    </div>
  );
}
